feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxFlash_regdef.h
/** \brief  Flash Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_FCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_FLASH_FCON;

/** \brief  Flash Protection Control and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_FPRO_Bits B;                  /**< \brief Bitfield access */
} Ifx_FLASH_FPRO;

/** \brief  Flash Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_FSR_Bits B;                   /**< \brief Bitfield access */
} Ifx_FLASH_FSR;

/** \brief  HSM Flash Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_HSMFCON_Bits B;               /**< \brief Bitfield access */
} Ifx_FLASH_HSMFCON;

/** \brief  Flash Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_HSMFSR_Bits B;                /**< \brief Bitfield access */
} Ifx_FLASH_HSMFSR;

/** \brief  Margin Control Register HSM DFlash */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_HSMMARD_Bits B;               /**< \brief Bitfield access */
} Ifx_FLASH_HSMMARD;

/** \brief  HSM Requested Read Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_HSMRRAD_Bits B;               /**< \brief Bitfield access */
} Ifx_FLASH_HSMRRAD;

/** \brief  Requested Read Control Register HSM */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_HSMRRCT_Bits B;               /**< \brief Bitfield access */
} Ifx_FLASH_HSMRRCT;

/** \brief  HSM Requested Read Data Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_HSMRRD0_Bits B;               /**< \brief Bitfield access */
} Ifx_FLASH_HSMRRD0;

/** \brief  HSM Requested Read Data Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_HSMRRD1_Bits B;               /**< \brief Bitfield access */
} Ifx_FLASH_HSMRRD1;

/** \brief  Flash Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_ID_Bits B;                    /**< \brief Bitfield access */
} Ifx_FLASH_ID;

/** \brief  Margin Control Register DFlash */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_MARD_Bits B;                  /**< \brief Bitfield access */
} Ifx_FLASH_MARD;

/** \brief  Margin Control Register PFlash */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_MARP_Bits B;                  /**< \brief Bitfield access */
} Ifx_FLASH_MARP;

/** \brief  DFlash Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_PROCOND_Bits B;               /**< \brief Bitfield access */
} Ifx_FLASH_PROCOND;

/** \brief  Debug Interface Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_PROCONDBG_Bits B;             /**< \brief Bitfield access */
} Ifx_FLASH_PROCONDBG;

/** \brief  HSM Interface Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_PROCONHSM_Bits B;             /**< \brief Bitfield access */
} Ifx_FLASH_PROCONHSM;

/** \brief  HSM Code Flash OTP Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_PROCONHSMCOTP_Bits B;         /**< \brief Bitfield access */
} Ifx_FLASH_PROCONHSMCOTP;

/** \brief  OTP Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_PROCONOTP_Bits B;             /**< \brief Bitfield access */
} Ifx_FLASH_PROCONOTP;

/** \brief  PFlash Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_PROCONP_Bits B;               /**< \brief Bitfield access */
} Ifx_FLASH_PROCONP;

/** \brief  Write-Once Protection Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_PROCONWOP_Bits B;             /**< \brief Bitfield access */
} Ifx_FLASH_PROCONWOP;

/** \brief  Read Buffer Cfg 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_FLASH_RDB_CFG0_Bits B;              /**< \brief Bitfield access */
} Ifx_FLASH_RDB_CFG0;

